#+title: Intro
#+index: 1
#+next: >> Variables and Simple Output:/variables-and-simple-output.html
#+breadcrumbs: index:/index.html

*** understand tools you can use
+ =who= allows us to see who is logged in:

#+begin_src bash :results output verbatim
who
#+end_src

#+RESULTS:
: nasreddin tty7         2025-08-18 18:34 (:0)
: nasreddin pts/1        2025-08-18 18:34 (tmux(1307).%0)

+ =wc= allows us to count words but also lines!
#+begin_src bash
ls | wc -l
#+end_src

#+RESULTS:
: 2

*** write it
Use a text editor and save it to a file.

Using =who= and =wc=, we can:
#+begin_src bash
who | wc -l
#+end_src

#+RESULTS:
: 2

Lets save that to a file:
#+begin_src bash
echo "who | wc -l" > scripts/nusers
#+end_src

*** run!
#+begin_src bash
./scripts/nusers
#+end_src

#+RESULTS:
: 3

*** Lets change our script
We can enhance it by printing *unique* logged in users

We can edit the file using any text editor...

#+begin_src bash
who | awk '{print $1}' | uniq | wc -l
#+end_src

#+RESULTS:
: 1

Now we see that there is only me logged in

